# QA Automation Python 14.03.2023
# Karpynska Karolina
# task2.2

# Задача 2. Напишіть программу "Касир в кінотеатрі", яка попросить користувача ввести свій вік.(можна використати константу або функцію input()
# на екран має бути виведено лише одне повідомлення, також подумайте над варіантами, коли введені невірні дані).
# a. якщо користувачу менше 7 - вивести повідомлення "Де твої батьки?"
# b. якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
# c. якщо користувачу більше 65 - вивести повідомлення "Покажіть пенсійне посвідчення!"
# d. якщо вік користувача містить цифру 7 - вивести повідомлення "Вам сьогодні пощастить!"
# e. у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"

age_str = input('Введіть свій вік: ')

try:

    age = int(age_str)

    if age <= 0 or age > 100:
        raise ValueError

    if age < 7:
        print('Де твої батьки?')
    elif age < 16:
        print('Це фільм для дорослих!')
    elif age > 65:
        print('Покажіть пенсійне посвідчення!')
    elif '7' in age_str:
        print('Вам сьогодні пощастить!')

    else:
        print('А білетів вже немає!')

except ValueError:
    print('Введено некоректні дані.')